# LoadAttrLinearForceScaleFactor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LoadAttrLinearForceScaleFactor Property
ParameterTypeId Class See Also
---
"Linear force scale"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LoadAttrLinearForceScaleFactor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LoadAttrLinearForceScaleFactor As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LoadAttrLinearForceScaleFactor {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace